{
    "personal-site": {
        "id": "personal-site",
        "PageTitle": "My Personal Website",
        "CoverPic": "https://res.cloudinary.com/eestevez/image/upload/v1627777210/myWorkPage/cardPics/website/mysite.png",
        "Background": "When it came time to showcase my work from the past few years, I saw an exciting opportunity to practice my web development skills. So, I decided to build my website from scratch!",
        "WhatIDid": "I chose React, a powerful open-source JavaScript library, to create the front end of my website. I kicked off the project with the create-react-app toolchain and styled it using Bootstrap's versatile CSS framework. Leveraging React's features, like hooks and state management, I created reusable components to streamline the development process. I also integrated several NPM packages, adding functionality such as a sleek image-loading skeleton and metadata updates for each page. To manage and store the images within my portfolio, I used Cloudinary. Finally, I deployed and hosted the entire site on Netlify.",
        "WhatILearned": "This project gave me hands-on experience with some of React's more advanced features, like React Hooks. I also deepened my knowledge of Bootstrap 5 and its extensive class library. Most importantly, I learned how crucial it is to ensure the app is functional across various devices, performance levels, and connection speeds. Building my personal website was a fantastic refresher and a significant enhancement of my web development skills.",
        "CarouselImages": [
        ]
    },
    "la-cosecha-tortilla": {
        "id": "la-cosecha-tortilla",
        "PageTitle": "La Cosecha Tortilleria Company Website",
        "CoverPic": "https://res.cloudinary.com/eestevez/image/upload/v1627777211/myWorkPage/cardPics/website/lacosechawebsite.png",
        "Background": "While being a member of the Advertisement Club at UW-Madison, I had the chance to network with many local businesses. One of these connections was La Cosecha Tortilleria Compan. The business owner reached out to me for assistance with their website. This opportunity marked my first venture into freelance work, and I accepted it with gratitude, thrilled that they were willing to take a chance on someone early in their career.",
        "Background2": "La Cosecha Tortilleria Company specializes in crafting homemade tortillas and other corn snacks. They manage the entire process, from sourcing corn from selected farms to producing the final edible products. Collaborating with the business owner was a pleasure, especially when I got to sample their delicious products!",
        "WhatIDid": "Before diving into the design work, I conducted several meetings to understand their business, branding, and website requirements. Armed with this knowledge, I proposed design ideas and discussed various hosting solutions to get their business online. We decided on Shopify, and I began developing the site. Additionally, I visited their facility to photograph their products and operations, ensuring the images were edited to best represent their offerings. This project is ongoing, with the website evolving as their business grows.",
        "WhatILearned": "This experience taught me how to implement and design a Shopify website and underscored the importance of maintaining excellent communication with business owners. Building a great relationship with my clients was key to delivering a website that truly met their needs.",
        "CarouselImages": [
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/cosecha1.png",
                "label": "La Cosecha Home Page",
                "desc": "The homepage features a captivating carousel of images, serving as the hero header for the site and complemented by impactful phrases."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/cosecha2.png",
                "label": "n additional view of the La Cosecha homepage, showcasing its dynamic and engaging design."
            }
        ]
    },
    "NCJS": {
        "id": "NCJS",
        "PageTitle": "National Collegiate Journal of Science (NCJS)",
        "CoverPic": "https://res.cloudinary.com/eestevez/image/upload/v1716428774/ncjs_background.jpg",
        "Background": "Through my work at JUST (Journal of Undergraduate Science and Technology), I was contacted by the National Collegiate Journal of Science (NCJS), a new organization dedicated to publishing academic research articles written by students nationwide and fostering discussions about STEM fields and advancements. Since NCJS was just starting, they asked me to design and build their website.",
        "WhatIDid": "My role was web designer and UX/UI developer. I worked with the Director of NCJS as well as the graphic designer in the organization. Leveraging my experience from JUST, I proposed a WordPress website. I began by designing the site in Adobe XD and then built it using a free theme that I customized extensively with HTML and CSS. Additionally, I created a walkthrough tutorial video to guide the team on how to post new articles on the site.",
        "WhatILearned": "This project allowed me to develop a WordPress website for a new organization, which significantly enhanced my communication skills. Ensuring I delivered satisfactory work promptly was crucial, and this experience helped me grow in managing client relationships and expectations.",
        "CarouselImages": [
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/ncjs2.png",
                "label": "Adobe XD Design",
                "desc": "Prior to implementing the website design on Wordpress, I crafted this mockup using Adobe XD."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/ncjs3.png",
                "label": "Adobe XD Prototype",
                "desc": "To simulate a functional website, I linked components across pages within Adobe XD."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/ncjs4.png",
                "label": "Adobe XD Design Comments",
                "desc": "Utilizing Adobe XD's collaboration features, I shared the design with colleagues to gather feedback."
            },
            {
              "src": "https://res.cloudinary.com/eestevez/image/upload/v1716429199/NCJS_Sketch.jpg",
              "label": "Notebook Sketch",
              "desc": "Received a preliminary sketch from Sam Neff, providing a foundation for my design decisions and wireframing process."
          },
          {
            "src": "https://res.cloudinary.com/eestevez/image/upload/v1716429217/ncjsColor.png",
            "label": "NCJS Graphic Charter 1",
            "desc": "An excerpt from the graphic charter outlining the color palette for NCJS branding."
        },
        {
          "src": "https://res.cloudinary.com/eestevez/image/upload/v1716429217/ncjsFont.png",
          "label": "NCJS Graphic Charter 2",
          "desc": "An excerpt from the graphic charter outlining the color palette for NCJS branding."
      }
        ]
    },
    "apprisen-website-redesign": {
        "id": "apprisen-website-redesign",
        "PageTitle": "Apprisen Website Redesign (JP Morgan Chase Hackathon)",
        "CoverPic": "https://res.cloudinary.com/eestevez/image/upload/v1627777211/myWorkPage/cardPics/website/codeForGood.jpg",
        "Background": "In the fall of 2020, I had the privilege of participating in the Code for Good 24-hour hackathon in Columbus, Ohio, hosted by JP Morgan Chase & Co. This event brought together creative minds to collaborate on projects benefiting local communities. Our challenge was to revamp the website and user experience for Apprisen, an organization dedicated to promoting financial literacy and assisting individuals in managing debt.",
        "WhatIDid": "Tasked with enhancing the UI/UX of the web app, I immersed myself in sketching out design concepts and updating the organization's logo. Leveraging HTML, CSS, and Flask, I meticulously crafted the user interface elements using Adobe Creative Suite. Our focus was on creating a seamless user experience, ensuring easy access to program information and fostering motivation for users to achieve their financial goals.",
        "WhatILearned": "The intense 24-hour timeframe of the hackathon taught me valuable lessons in time management and adaptability. As we battled sleep deprivation, I learned to regulate my caffeine intake to maintain focus and productivity. Additionally, delving into Flask expanded my understanding of web frameworks and their application in real-world projects. Most importantly, I gained insights into the emotional impact of UI elements and the importance of thoughtful copywriting in driving user motivation.",
        "CarouselImages": [
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/apprisen1.png",
                "label": "Design Scribbles",
                "desc": "On the home page, users are greeted with a friendly welcome message alongside the current date. Their login streak is prominently displayed, encouraging regular visits to monitor their financial progress. A progress bar offers a visual representation of their debt payment journey, empowering users to track their advancement towards financial goals at a glance."
            }
        ]
    },
    "the-longevity-game": {
        "id": "the-longevity-game",
        "PageTitle": "The Longevity Game",
        "CoverPic": "https://res.cloudinary.com/eestevez/image/upload/v1627777211/myWorkPage/cardPics/website/longgame.png",
        "Background": "In the summer of 2017, I participated in Northwestern Mutual’s STEM Outreach program, a 4-week initiative aimed at providing high school students with a crash course in web development. As part of the program, 12 students, including myself, were tasked with modernizing \"The Longevity Game,\" a flash game on Northwestern Mutual's website.",
        "Background2": "The original flash game prompted users to input personal information such as age and gender, then guided them through a series of lifestyle and health-related questions to determine their probable life expectancy. While the premise was somewhat sobering, the intention was to spark discussions about life insurance and encourage healthy habits.",
        "WhatIDid": "Through this experience, I honed my skills in HTML, CSS, and JavaScript, gaining a deeper understanding of web development fundamentals. I also explored the versatility of SVG graphics and experimented with advanced CSS properties like background blur, expanding my toolkit for future projects.",
        "WhatILearned": "Aside from basic web development skills within HTML, CSS, and JavaScript, I learned how customizable SVG graphics were, as well as new CSS properties I did not play around with before, such as background blur.",
        "CarouselImages": [
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/long1.png",
                "label": "Start Screen",
                "desc": "Welcoming users to the game, this screen served as the entry point to the experience."
                },
                {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/long2.png",
                "label": "Create Your Character Screen",
                "desc": "Upon selecting a character, animated clouds would gracefully part, unveiling the chosen character."
                },
                {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/long3.png",
                "label": "Create Your Character Screen",
                "desc": "Leveraging SVG files for all images enabled easy customization of item colors by targeting specific CSS classes."
                },
                {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/long4.png",
                "label": "Backpack Explanation",
                "desc": "Just before starting the game, users were informed that they could click on the backpack to track progress and view earned badges."
                },
                {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/long5.png",
                "label": "Survey Answer Choice",
                "desc": "Each selected answer dynamically influenced the user's predicted lifespan, recalculating in real time based on all responses."
                },
                {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/long6.png",
                "label": "Thank You For Playing Screen",
                "desc": "Presenting the final calculated lifespan alongside the user's character and badges, this screen thanked users for participating."
                },
                {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/long7.png",
                "label": "Additional Information",
                "desc": "Encouraging dialogue about financial products, the game included a feature to connect users with representatives upon completion."
                }
        ]
    },
    "risk-assessment-and-aggregate-application": {
        "id": "risk-assessment-and-aggregate-application",
        "PageTitle": "Risk Assessment and Aggregate Application",
        "CoverPic": "https://res.cloudinary.com/eestevez/image/upload/v1627777211/myWorkPage/cardPics/website/nm.jpg",
        "Background": "During my second summer interning at Northwestern Mutual, I had the opportunity to collaborate with the Enterprise Architecture team on a project aimed at rethinking the company's approach to risk assessments. Working alongside another intern, our task was to streamline the process of analyzing risk assessment documents and identifying dependencies between applications and services.",
        "WhatIDid": "My role primarily involved front-end development using React for the risk assessment platform. However, I also dedicated time to understanding risk management principles and gathering insights from stakeholders, including managers, to ensure our solution aligned with their needs. While my focus was on the frontend, my colleague handled backend development, and together we integrated React with MongoDB, leveraging Python scripts for data scraping.",
        "WhatILearned": "This experience was a significant learning curve for me, particularly as I had no prior experience with React. I approached learning with humility, relying on a mix of online tutorials and experimentation to grasp the technology. Additionally, delving into the complexities of risk within a corporate setting provided valuable insights into enterprise risk management practices.",
        "CarouselImages": []
    },
    "custom-implicit-bias-test": {
        "id": "custom-implicit-bias-test",
        "PageTitle": "Custom Implicit Bias Test",
        "CoverPic": "https://res.cloudinary.com/eestevez/image/upload/v1627777211/myWorkPage/cardPics/website/lis500.png",
        "Background": "During the fall semester of my junior year in 2019, I enrolled in LIS 500: Code and Power, a course focused on examining the portrayal of race, gender, religion, and other social constructs in computing. Through critical analysis, we explored topics such as biased training data in machine learning models and discriminatory search results on platforms like Google.",
        "Background2" : "For our final project, my team and I developed a survey inspired by the Harvard Implicit Bias Test. Designed to uncover implicit biases related to race, gender, and other factors, our survey aimed to raise awareness of unconscious prejudices among participants. We crafted original questions to prompt honest responses and tracked survey results using HTML, CSS, and PHP.",
        "WhatIDid": "As part of the team, I contributed to designing the survey questions and developing the website infrastructure. Utilizing HTML, CSS, and PHP, I ensured a seamless user experience and implemented features to track and analyze survey responses. Additionally, I created informative videos to accompany the survey, providing context and insights into the results.",
        "WhatILearned": "While honing my technical skills in PHP and web development, the course provided a deeper understanding of the societal implications of technology. Discussions on representation and diversity within the tech industry shed light on pressing issues, including biased algorithms and the lack of diversity in major tech companies. This experience sparked critical reflection on the ethical responsibilities of technologists and the importance of addressing systemic biases in technology.",
        "CarouselImages": []
    },
    "freesound-website-redesign": {
        "id": "freesound-website-redesign",
        "PageTitle": "Freesound Website Redesign",
        "CoverPic": "https://res.cloudinary.com/eestevez/image/upload/v1627777211/myWorkPage/cardPics/website/freesound.png",
        "Background": "During the fall semester of my senior year in 2020, I enrolled in LSC 532: Web Design for the Sciences, a course dedicated to effectively communicating scientific information through accessible web design. For one assignment, I chose to reimagine the design of freesounds.org, a platform I frequently used to source sound effects for video projects. Recognizing its potential for greater user engagement, I aimed to modernize the website to foster a vibrant community of sound enthusiasts.",
        "WhatIDid": "To begin, I identified key objectives for the FreeSound platform, envisioning increased traffic, enhanced community interaction, and greater user support. Leveraging Adobe XD, I crafted a redesign centered on user-friendly navigation and prominent page descriptions to welcome new visitors. The homepage featured real-time metrics such as active users and uploaded sounds, creating a dynamic atmosphere to encourage participation. I translated these design concepts into a functional prototype using React.",
        "WhatILearned": "Through this project, I learned to design websites that not only prioritize simplicity and elegance but also strategically guide user actions. By emphasizing community engagement and social interaction, I discovered the power of nudging users towards desired behaviors, such as account creation and content sharing. This experience underscored the importance of thoughtful web design in fostering vibrant online communities and promoting meaningful interactions.",
        "CarouselImages": [

            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/freesound1.png",
                "label": "Adobe XD Design",
                "desc": "I redesigned the UI using Adobe XD, focusing on the Home Page and Sound Page to create a minimal viable product (MVP)."
                },
                {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/freesound2.png",
                "label": "Original Website Design",
                "desc": "This is the original design of the website (https://freesound.org/) at the time of my redesign."
                }
        ]
    },
    "university-of-wisconsin-arboretum-website-redesign": {
        "id": "university-of-wisconsin-arboretum-website-redesign",
        "PageTitle": "University of Wisconsin-Arboretum Website Redesign",
        "CoverPic": "https://res.cloudinary.com/eestevez/image/upload/v1627777211/myWorkPage/cardPics/website/arb.png",
        "Background": "During the fall semester of my senior year in 2020, I enrolled in LSC 532: Web Design for the Sciences, a course emphasizing the clear and accessible communication of scientific information online. For our final project, my team collaborated to redesign the website for the University of Wisconsin Arboretum (https://arboretum.wisc.edu/), aiming to enhance user engagement and streamline information accessibility.",
        "Background2": "Our approach began with gathering insights from an original designer of the website and analyzing site analytics to identify user preferences and traffic patterns. Armed with this information and user archetypes representing diverse visitor needs, we crafted a modern redesign focused on presenting key information prominently on the homepage. Additionally, we restructured sections of the site using a question-answer format to simplify navigation, particularly within the Visit section.",
        "WhatIDid": "I took the lead in gathering insights from the original website designer and conducting user research to inform our redesign strategy. Collaborating closely with my team, I translated these insights into a comprehensive redesign plan aimed at addressing user needs and improving overall website usability.",
        "WhatILearned": "This project reinforced the importance of thorough client/project owner interactions to understand goals and user needs effectively. By asking pertinent questions and empathizing with diverse user perspectives, we were able to prioritize redesign efforts and deliver a minimal viable product tailored to user expectations. Additionally, this experience provided valuable insights into user-centric design principles and the iterative nature of web development.",
        "CarouselImages": [
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/arb1.png",
                "label": "Redesigned Home Page",
                "desc": "This new website now spans the entire width of the screen and features information about the Arboretum, including Our Mission and Our Vision statements."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/arb1.png",
                "label": "Original Home Page",
                "desc": "The original page had its content width style as boxed and was not welcoming to new visitors unfamiliar with the Arboretum."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/arb2.png",
                "label": "Redesigned Visit Page",
                "desc": "The content within the Visit page was restructured into sections in a Question-Answer style, allowing users to find specific information quickly."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/arb3.png",
                "label": "Original Visit Page",
                "desc": "The original visit page had its content under different sections but presented information in paragraphs without clear distinctions."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/arb4.png",
                "label": "Redesigned Learn Page",
                "desc": "The new Learn page features content organized in a Question-Answer style and utilizes accordion components to prevent overwhelming users with unnecessary text."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/arb5.png",
                "label": "Original Learn Page",
                "desc": "Similar to the original Visit page, information was presented in paragraphs and sections without clear labeling."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/harold.png",
                "label": "Harold Persona Info",
                "desc": "When redesigning the page, it was essential to create personas like Harold to guide design and concept decisions."
            },
            {
                "src": "https://res.cloudinary.com/eestevez/image/upload/v1627777207/myWorkPage/website/sarah.png",
                "label": "Harold Persona Info",
                "desc": "Two personas were developed for this project, with Harold being the first and Sarah being the second."
            }
        ]
    }
}